[
  {
    "id": "f4b8eab1-627a-44bc-9668-b09ef3ba9088",
    "timestamp": "2025-04-30T01:27:24.692Z",
    "input": {
      "country": "Colombia",
      "income": 1000,
      "monthlyExpenses": null,
      "monthlyDebtPayment": null,
      "totalDebt": null,
      "remainingInstallments": null,
      "savings": 2000000,
      "financialGoal": "Empezar a invertir",
      "mainObstacle": "no lo se",
      "financialExperience": "Muy poco, casi nada"
    },
    "modelResponse": "```json\n{\n  \"nombre\": \"Hola,\",\n  \"introduccion\": \"Entiendo tu situación y estoy aquí para ayudarte a darle un giro positivo a tus finanzas. Sé que en Colombia a veces cuesta llegar a fin de mes, pero con un plan claro y algunos ajustes, podemos empezar a construir un futuro financiero más sólido.\",\n  \"diagnostico\": \"Actualmente, tenemos una mezcla de buenas y malas noticias. Lo positivo es que tienes un ahorro de 2,000,000, lo cual es un excelente punto de partida. Lo preocupante es que no tenemos claridad sobre tus gastos mensuales ni tus deudas. No saber a dónde se va tu dinero y cuánto debes es como navegar a ciegas: puedes estar gastando más de lo que crees o pagando intereses innecesarios. Entiendo que sientas que no sabes por dónde empezar, pero la falta de información es el principal obstáculo en este momento. Con un ingreso de 1,000, es fundamental tener claridad sobre tus gastos y deudas para saber si te alcanza, cuánto te sobra y cómo optimizar tu dinero. Es posible que sientas que no te alcanza porque estás gastando en cosas que no te dan valor o porque estás pagando cuotas altas por deudas que podrías renegociar.\",\n  \"plan\": {\n    \"intro\": \"Para empezar a poner en orden tus finanzas, te propongo estas acciones concretas:\",\n    \"semana\": \"<b>1. Haz un inventario de tus gastos:</b> Esta semana, anota absolutamente todo en lo que gastas, por pequeño que sea. Usa una libreta, una hoja de cálculo o la app que más te guste. No te juzgues, solo registra. Gastos como el transporte, el café de la mañana, los domicilios, las suscripciones a plataformas, todo cuenta.\",\n    \"mes\": \"<b>2. Descubre los detalles de tus deudas:</b> Llama a tus bancos, revisa tus extractos y averigua exactamente cuánto debes, a cuántas cuotas y cuál es la tasa de interés. Esta información es clave para saber si puedes renegociar o consolidar tus deudas para pagar menos intereses.\",\n    \"tresMeses\": \"<b>3. Crea un plan de inversión inicial:</b> Con la información de tus gastos y deudas, y con tus ahorros, define un porcentaje pequeño de tus ingresos que puedas destinar a inversión cada mes. Empieza con algo pequeño, ¡lo importante es crear el hábito! Busca opciones de inversión seguras y de bajo riesgo, como un CDT o un fondo de inversión de bajo perfil.\"\n  },\n  \"ideas\": [\n    \"<i>Aplica la regla del 50/30/20:</i> Destina el 50% de tus ingresos a gastos fijos (arriendo, servicios, transporte), el 30% a gastos variables (ocio, ropa, salidas) y el 20% al ahorro e inversión.\",\n    \"<i>Automatiza tus ahorros:</i> Configura una transferencia automática desde tu cuenta principal a una cuenta de ahorros o de inversión cada vez que recibas tu salario. Así te aseguras de ahorrar antes de gastar.\",\n    \"<i>Aprovecha los descuentos y promociones:</i> Antes de comprar algo, busca si hay descuentos o promociones disponibles. ¡Cada peso cuenta!\",\n    \"<i>Reduce los gastos hormiga:</i> Esos pequeños gastos diarios que parecen insignificantes (un café, un dulce, un domicilio) pueden sumar una gran cantidad de dinero al final del mes. Identifícalos y busca alternativas más económicas.\"\n  ],\n  \"mensajeFinal\": \"El camino hacia la estabilidad financiera se construye paso a paso. ¡Confía en ti y celebra cada pequeño logro!\"\n}\n```",
    "notes": "Generación de plan financiero (vía Gemini)"
  },
  {
    "id": "5cda6d90-ae61-45b2-9801-07ae0459a154",
    "timestamp": "2025-04-30T01:30:57.264Z",
    "input": {
      "country": "Mexico",
      "income": 2000,
      "monthlyExpenses": null,
      "monthlyDebtPayment": null,
      "totalDebt": null,
      "remainingInstallments": null,
      "savings": 0,
      "financialGoal": "Ahorrar para algo específico",
      "mainObstacle": "no lo se",
      "financialExperience": "Muy poco, casi nada"
    },
    "modelResponse": "```json\n{\n  \"nombre\": \"¡Hola!\",\n  \"introduccion\": \"Entiendo que te sientas un poco perdido con tus finanzas, ¡pero no te preocupes! Aquí estamos para ponerle orden a este asunto. Con los datos que me has dado, vamos a armar un plan sencillo pero efectivo para que empieces a ver resultados pronto.\",\n  \"diagnostico\": \"Con un ingreso de $2000 pesos y sin saber exactamente en qué se te va el dinero ni cuánto debes, es como manejar un coche con los ojos vendados. No sabemos si te alcanza, si estás gastando de más o si las deudas te están ahogando. El primer paso es quitarse esa venda y ver claramente el panorama. Además, con cero ahorros, estás en modo 'empezar desde cero', pero ¡ánimo! Todos hemos estado ahí.\\n\\nEntiendo que sientas que no tienes control sobre tus finanzas y que ahorrar para algo específico se vea como una meta lejana. Sin embargo, tus ingresos podrían ser suficientes para cubrir tus gastos y empezar a ahorrar, pero necesitamos saber a dónde se está yendo tu dinero. Es probable que pequeños gastos diarios estén sumando una cantidad importante al final del mes, impidiendo que alcances tus objetivos.\",\n  \"plan\": {\n    \"intro\": \"Para empezar a tomar el control de tus finanzas, te propongo este plan de acción sencillo y directo:\",\n    \"semana\": \"<b>1. Detecta a dónde se va tu dinero:</b> Esta semana, apunta cada gasto, por pequeño que sea. Usa una libreta, una app en tu celular, o incluso las notas de tu teléfono. ¡Todo cuenta! Desde el café de la mañana hasta el transporte público.  \\n\\n<b>2. Averigua TODO sobre tus deudas:</b> Llama a tu banco o revisa tus estados de cuenta en línea. Necesitas saber el monto total que debes, la tasa de interés y cuántos pagos te faltan. Esta información es crucial para saber dónde estás parado y cómo puedes mejorar las cosas.\",\n    \"mes\": \"<b>1. Clasifica tus gastos:</b> Revisa tu lista de gastos de la semana y divídela en categorías: comida, transporte, entretenimiento, deudas, etc. Esto te dará una idea clara de en qué estás gastando más.\\n\\n<b>2. Crea un plan de pago para tus deudas:</b> Con la información que obtuviste, define una estrategia. ¿Conviene pagar primero la deuda más pequeña para motivarte o la que tiene la tasa de interés más alta para ahorrar dinero a largo plazo?\",\n    \"tresMeses\": \"<b>1. Ajusta tus gastos:</b> Identifica áreas donde puedas reducir gastos sin sacrificar tu calidad de vida. ¿Realmente necesitas todas esas suscripciones? ¿Puedes preparar tu café en casa en lugar de comprarlo en la calle?\\n\\n<b>2. Automatiza tus ahorros:</b> Abre una cuenta de ahorros separada y programa transferencias automáticas desde tu cuenta principal cada mes, aunque sea una pequeña cantidad. ¡Lo importante es empezar a crear el hábito!\"\n  },\n  \"ideas\": [\n    \"Empieza por pequeños cambios. Lleva tu propia comida al trabajo algunos días a la semana. ¡Verás cómo ahorras!\",\n    \"Si tienes antojos, date un gusto de vez en cuando, pero con moderación. No te prives por completo, pero tampoco te excedas.\",\n    \"Considera buscar ingresos extras. Vende cosas que ya no uses, ofrece tus servicios en línea o busca un trabajo de medio tiempo. ¡Todo suma!\",\n    \"¡No te compares con los demás! Cada persona tiene su propio ritmo y sus propias circunstancias. Enfócate en tu propio progreso.\"\n  ],\n  \"mensajeFinal\": \"El camino hacia la estabilidad financiera se construye paso a paso. ¡Confía en ti y celebra cada pequeño logro!\"\n}\n```",
    "notes": "Generación de plan financiero (vía Gemini)"
  },
  {
    "id": "74fcadf2-db99-4d37-9d17-5afd4461ad76",
    "timestamp": "2025-04-30T01:45:56.651Z",
    "input": {
      "country": "Colombia",
      "income": 1000000,
      "monthlyExpenses": null,
      "monthlyDebtPayment": null,
      "totalDebt": null,
      "remainingInstallments": null,
      "savings": 0,
      "financialGoal": "Aprender a organizarme",
      "mainObstacle": "no lo se",
      "financialExperience": "Sé lo básico"
    },
    "modelResponse": "```json\n{\n  \"nombre\": \"¡Hola!\",\n  \"introduccion\": \"Entiendo perfectamente tu situación. En Colombia, con un ingreso como el tuyo, es totalmente normal querer organizarse mejor y sentir que no sabes por dónde empezar. ¡Pero no te preocupes, vamos a ponerle orden a esto!\",\n  \"diagnostico\": \"La verdad es que, con los datos que tenemos, es difícil saber si te está alcanzando el dinero o no. <b>No saber cuánto gastas al mes y cuánto debes es como manejar a ciegas.</b> Eso sí, el hecho de que no tengas ahorros, con un ingreso de $1.000.000, sugiere que estás gastando todo lo que entra, o incluso más. Entiendo que sientas que no sabes cómo mejorar tus finanzas, porque sin esta información básica, es como intentar armar un rompecabezas sin todas las piezas. Es muy común que gastos pequeños del día a día, como el tintico, el domicilio, o las suscripciones, se vayan sumando y terminen siendo una fuga importante de dinero.\",\n  \"plan\": {\n    \"intro\": \"Para empezar a tomar el control, vamos a enfocarnos en tres pasos clave:\",\n    \"semana\": \"<i>Esta semana</i>, tu misión principal es <b>descubrir a dónde se está yendo tu plata</b>. Agarra una libreta, usa una hoja de cálculo en tu celular, lo que te sea más fácil, y anota cada peso que gastes. Desde el pasaje del bus hasta el chicle que compraste en la tienda. No te preocupes por juzgarte, solo registra.\",\n    \"mes\": \"<i>Este mes</i>, además de seguir registrando tus gastos, vas a <b>averiguar exactamente cuánto debes</b>. Llama a tus bancos, revisa tus extractos, y anota el monto total de la deuda, la cuota mensual que estás pagando, y el número de cuotas que te faltan. ¡Esta información es vital para saber dónde estás parado!\",\n    \"tresMeses\": \"<i>En tres meses</i>, con la información de tus gastos y deudas organizada, vas a <b>crear un plan sencillo para empezar a ahorrar</b>. Define una meta pequeña, como ahorrar $50.000 al mes, y automatiza ese ahorro. Puedes crear una cuenta aparte solo para eso, o usar un sobre marcado con tu meta. ¡Lo importante es empezar a crear el hábito!\"\n  },\n  \"ideas\": [\n    \"Empieza por identificar tus gastos fijos (arriendo, servicios, transporte) y luego enfócate en los variables (comida, entretenimiento, antojos).\",\n    \"Usa la regla 50/30/20: 50% de tu ingreso para necesidades básicas, 30% para deseos, y 20% para ahorro y pago de deudas.\",\n    \"Si tienes deudas, prioriza las que tengan la tasa de interés más alta. Pagar esa deuda primero te ahorrará mucho dinero a largo plazo.\",\n    \"Revisa tus suscripciones. ¿Realmente usas todas las que estás pagando? Cancela las que no necesitas.\"\n  ],\n  \"mensajeFinal\": \"¡No te abrumes! Organizar tus finanzas es un proceso, no una carrera. Cada pequeño paso que des te acerca a tus metas. ¡Confía en ti y celebra cada logro!\"\n}\n```",
    "notes": "Generación de plan financiero (vía Gemini)"
  },
  {
    "id": "6bd2e65f-889f-4cbe-989e-e2d227b80acc",
    "timestamp": "2025-05-06T23:11:04.519Z",
    "input": {
      "country": "Colombia",
      "income": 4000000,
      "monthlyExpenses": null,
      "monthlyDebtPayment": null,
      "totalDebt": null,
      "remainingInstallments": null,
      "savings": 2000000,
      "financialGoal": "Empezar a invertir",
      "mainObstacle": "no se como hacerlo",
      "financialExperience": "Muy poco, casi nada"
    },
    "modelResponse": "```json\n{\n  \"nombre\": \"¡Hola!\",\n  \"introduccion\": \"Veo que quieres empezar a invertir, ¡excelente! Es un gran paso para tu futuro financiero. Pero antes de lanzarnos, vamos a entender bien dónde estás parado y cómo podemos avanzar con paso firme.\",\n  \"diagnostico\": \"Con un ingreso de $4.000.000, tienes una base sólida para construir algo importante. Sin embargo, hay algunas cosas que necesitamos aclarar para tener una radiografía completa de tu situación. Por ejemplo, no sabemos cuánto estás gastando al mes, ni si tienes deudas (más allá de la cuota mensual que mencionas). Esto es como querer construir una casa sin saber si el terreno es firme o no. \\n\\nEntiendo que quieras empezar a invertir ya, pero sin estos datos, podríamos estar dando palos de ciego. Es como si estuvieras manejando un carro sin saber cuánta gasolina tienes: podrías quedarte varado a mitad de camino. Con la información que tenemos, no puedo saber si realmente te sobra dinero a fin de mes, o si estás llegando justo y cualquier imprevisto te desestabiliza.\\n\\nPor otro lado, tienes $2.000.000 ahorrados, lo cual es un excelente punto de partida. No es una fortuna, pero es una base para empezar a construir tu futuro financiero. Podríamos decir que estás en modo \\\"empezar\\\", y eso es muy bueno.\",\n  \"plan\": {\n    \"intro\": \"Para empezar a poner en orden tus finanzas y acercarte a tu meta de inversión, te propongo este plan sencillo y práctico:\",\n    \"semana\": \"1. <b>Rastrea tus gastos:</b> Esta semana, anota cada peso que gastes. Usa una libreta, una hoja de cálculo en tu celular, lo que te sea más fácil. No te preocupes por juzgarte, solo observa a dónde va tu dinero. Gastos como el transporte, el cafecito de la mañana, los domicilios, las salidas con amigos... ¡todo cuenta!  Así sabremos si te alcanza o no te alcanza realmente a fin de mes.\\n\\n2. <b>Investiga tus deudas:</b> Llama a tu banco o revisa tus extractos. Necesitas saber el monto total de tus deudas, cuántas cuotas te faltan y la tasa de interés que estás pagando. Esto es clave para saber si estás pagando mucho y si hay opciones para mejorar.\",\n    \"mes\": \"1. <b>Analiza tus gastos y crea un plan:</b> Revisa lo que anotaste la semana pasada. Identifica dónde estás gastando más y dónde podrías recortar. No se trata de vivir como un monje, sino de ser consciente de tus gastos y tomar decisiones informadas. Con esa información, crea un plan sencillo: cuánto vas a gastar en cada cosa, cuánto vas a destinar a pagar deudas (si las tienes) y cuánto vas a ahorrar para invertir.\\n\\n2. <b>Automatiza tus ahorros:</b> Abre una cuenta aparte (puede ser una cuenta de ahorros normal) y programa una transferencia automática desde tu cuenta principal cada mes. Así, el ahorro se convierte en una prioridad y no en algo que haces si te sobra plata al final del mes. Empieza con un monto pequeño, pero constante.\",\n    \"tresMeses\": \"1. <b>Evalúa tus progresos y ajusta tu plan:</b> Revisa cómo te ha ido con tu plan de gastos y ahorros. ¿Estás cumpliendo tus metas? ¿Necesitas hacer ajustes? No te desanimes si te has equivocado, lo importante es aprender de tus errores y seguir adelante.\\n\\n2. <b>Empieza a investigar opciones de inversión:</b> Ahora que tienes tus finanzas más claras y estás ahorrando regularmente, puedes empezar a explorar diferentes opciones de inversión. No te lances a lo loco, investiga, lee, pregunta a personas que sepan del tema. Recuerda que invertir tiene sus riesgos, así que es importante estar bien informado.\"\n  },\n  \"ideas\": [\n    \"Piensa en tus gastos como si fueran 'hormigas' que poco a poco se comen tu ingreso. Si no las controlas, te dejan sin nada a fin de mes.\",\n    \"Pequeños cambios hacen una gran diferencia. Por ejemplo, preparar tu propio almuerzo en lugar de pedir domicilio puede ahorrarte una buena cantidad de dinero al mes. En Colombia solemos gastar mucho en cosas pequeñas.\",\n    \"No te compares con los demás. Cada persona tiene su propio camino y sus propias circunstancias. Enfócate en mejorar tu propia situación y celebra tus pequeños logros.\",\n    \"Recuerda que el objetivo no es ser rico de la noche a la mañana, sino construir un futuro financiero sólido y tranquilo. ¡La constancia es clave!\"\n  ],\n  \"mensajeFinal\": \"¡Dale! El primer paso es el más difícil, pero también el más importante. Confío en que puedes lograrlo.\"\n}\n```",
    "notes": "Generación de plan financiero (vía Gemini)"
  }
]